Revit 2024 API
ViewFamily Enumeration
 An enumerated type that corresponds to the type of a Revit view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ViewFamily
Visual Basic
Public Enumeration ViewFamily
Visual C++
public enum class ViewFamily
Members
Member name | Description
Invalid |  Invalid view type.
ThreeDimensional |  3D view.
Walkthrough |  Walkthrough view.
ImageView |  Rendering view.
Schedule |  Schedule view.
CostReport |  Cost report view (obsolete).
Sheet |  Sheet view.
Drafting |  Drafting view.
FloorPlan |  Floor plan view.
AreaPlan |  Area plan view.
CeilingPlan |  Ceiling plan view.
Section |  Section view.
Detail |  Detail view.
Elevation |  Elevation view.
LoadsReport |  HVAC load report.
PressureLossReport |  Pressure loss report.
Legend |  Legend view.
PanelSchedule |  Panel schedule.
GraphicalColumnSchedule |  Graphical column schedule.
StructuralPlan |  Structural plan view.
SystemsAnalysisReport |  Systems analysis report.
See Also
Autodesk.Revit.DB Namespace